TexasInstruments/f29h85x-sdk/examples/driverlib/single_core/dlt/dlt_ex1_datalog_tag/dlt_ex1_datalog_tag.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "F29H85x" --package "256ZEX" --part "F29H85x_256ZEX" --context "CPU1" --product "MCU_SDK_F29H85x@1.02.02.00"
 * @v2CliArgs --device "F29H850TU" --package "256ZEX" --variant "TMS320F29H850TU9" --context "CPU1" --product "MCU_SDK_F29H85x@1.02.02.00"
 * @versions {"tool":"1.25.0+4237"}
 */

    
const divider15       = system.clockTree["PLL_REFDIV"];
divider15.divideValue = 1;

const multiplier1         = system.clockTree["PLL_IMULT"];
multiplier1.multiplyValue = 40;

const mux7       = system.clockTree["OSCCLKSRCSEL"];
mux7.inputSelect = "INTOSC2";

/**
 * Import the modules used in this configuration.
 */
const dlt = scripting.addModule("/driverlib/dlt.js");

/**
 * Write custom configuration values to the imported modules.
 */
dlt.enableTagFilter     = true;
dlt.endTagReference     = 0x2;
dlt.startTagMask        = 0xFFFF;
dlt.endTagMask          = 0xFFFF;
dlt.startTagReference   = 0x5;
dlt.DMAInst             = "RTDMA2_BASE";
dlt.setFIFOTriggerLevel = 0;
dlt.periphClock.$name   = "driverlib_perClock4";
dlt.periphConfig.$name  = "driverlib_perConfig3";
